Обработки/Reports/_СверкаПоказателейОтчетаОПотоках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СверкаПоказателейОтчетаОПотоках</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СверкаПоказателейОтчетаОПотоках/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Сверка показателей отчета о потоках",
		"0.07",
		"",
		Истина);
		
	// команды отсутствуют - только интерактивный запуск
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьПараметрыШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _КлиентДоверительногоУправления
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицОрганизации.КраткоеНаименованиеПоУставу КАК ДоверительныйУправляющий,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора,
		|	&Период КАК ДатаОтчета,
		|	&ПоследнийРабочийДень КАК ПоследнийРабочийДень,
		|	ЕСТЬNULL(РеквизитыЮридическихЛицКлиента.КраткоеНаименованиеПоУставу, РеквизитыФизическихЛицКлиента.Фамилия + "" "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Имя, 1, 1) + "". "" + ПОДСТРОКА(РеквизитыФизическихЛицКлиента.Отчество, 1, 1) + ""."") КАК УчредительУправления
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			ЮрФизЛицо = &ЮрФизЛицо
		|				И Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицОрганизации,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления,
		|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицКлиента.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицКлиента
		|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыЮридическихЛицКлиента.ЮрФизЛицо
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
		
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ПоследнийРабочийДень", НачалоДня(Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, ЭтотОбъект.Период.ДатаОкончания)));
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.Организация.ЮрФизЛицо);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
		
КонецФункции

Функция ПолучитьОписаниеСтрокиОтчета(СтрокаОтчета)
	
	Если СтрокаОтчета = "П07" Тогда
		Возврат "Поступления от продажи и погашения финансовых активов или от размещения финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка";
	ИначеЕсли СтрокаОтчета = "П08" Тогда 
		Возврат "Платежи в связи с приобретением финансовых активов или погашением финансовых обязательств, оцениваемых по справедливой стоимости, изменение которой отражается в составе прибыли или убытка";
	ИначеЕсли СтрокаОтчета = "П29" Тогда 	
		Возврат "Поступления от продажи финансовых активов, имеющихся в наличии для продажи";
	ИначеЕсли СтрокаОтчета = "П30" Тогда 
		Возврат "Платежи в связи с приобретением финансовых активов, имеющихся в наличии для продажи";
	ИначеЕсли СтрокаОтчета = "П33" Тогда 
		Возврат "Прочие поступления от инвестиционной деятельности";
	ИначеЕсли СтрокаОтчета = "П34" Тогда 
		Возврат "Прочие платежи по инвестиционной деятельности";   
	ИначеЕсли СтрокаОтчета = "П15" Тогда
		Возврат "Прочие денежные потоки от операционной деятельности"
	Иначе
		Возврат "";
	КонецЕсли 	
	
КонецФункции	

Процедура СформироватьОтчет(ДокРезультат)	Экспорт
	
	Сессия = Неопределено;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()";
	Попытка
    	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	Исключение
	КонецПопытки;

	ДокРезультат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	БухПартииЦенныхБумагОбороты.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОбороты.УчетныйАктивЕПС В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоЦБдоПогашения,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОбороты.УчетныйАктивЕПС В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеДляПродажи))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоЦБдляПродажи,
		|	ВЫБОР
		|		КОГДА БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.Сделка
		|			ТОГДА БухПартииЦенныхБумагОбороты.Регистратор
		|		КОГДА БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|			ТОГДА ВЫРАЗИТЬ(БухПартииЦенныхБумагОбороты.Регистратор КАК Документ.ИсполнениеОбязательствПоСделке).Основание
		|		КОГДА БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.ПогашениеЦеннойБумаги
		|			ТОГДА БухПартииЦенныхБумагОбороты.Регистратор
		|	КОНЕЦ КАК Сделка
		|ПОМЕСТИТЬ _Сделки
		|ИЗ
		|	РегистрНакопления.БухПартииЦенныхБумаг.Обороты(
		|			ДОБАВИТЬКДАТЕ(&ПериодНачало, ДЕНЬ, -15),
		|			ДОБАВИТЬКДАТЕ(&ПериодОкончание, ДЕНЬ, 15),
		|			Регистратор,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.ЕдиныйБухгалтерскийУчет)) КАК БухПартииЦенныхБумагОбороты
		|ГДЕ
		|	(БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.Сделка
		|			ИЛИ БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|			ИЛИ БухПартииЦенныхБумагОбороты.Регистратор ССЫЛКА Документ.ПогашениеЦеннойБумаги)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК ВидДвиженияДС,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет КАК КорСчет,
		|	""<...>"" КАК Сделка,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСубконто1 В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					УчетныеАктивыЕПС.АналитикаРасходовОтОпераций КАК АналитикаРасходовОтОпераций
		|				ИЗ
		|					Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|				ГДЕ
		|					УчетныеАктивыЕПС.Родитель В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеЧерезПСД), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеКромеВекселейДляПродажиИДоПогашения)))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоЦБдоПогашения,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.КорСубконто1 В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					УчетныеАктивыЕПС.АналитикаРасходовОтОпераций КАК АналитикаРасходовОтОпераций
		|				ИЗ
		|					Справочник.УчетныеАктивыЕПС КАК УчетныеАктивыЕПС
		|				ГДЕ
		|					УчетныеАктивыЕПС.Родитель В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолговыеДляПродажи), ЗНАЧЕНИЕ(Справочник.УчетныеАктивыЕПС.ДолевыеДляПродажи)))
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоЦБдляПродажи,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот КАК СуммаОборот
		|ПОМЕСТИТЬ _НераспределеннаяКомиссия
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ПериодНачало,
		|			&ПериодОкончание,
		|			Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка)),
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НЕОПРЕДЕЛЕНО,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2,
		|	ЛОЖЬ,
		|	ЛОЖЬ,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ПериодНачало,
		|			&ПериодОкончание,
		|			Период,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто2 В (ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа), ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа))
		|				И ТИПЗНАЧЕНИЯ(КорСубконто2) = ТИП(Документ.СделкаСВалютой),
		|			КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.Расчеты22)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_Сделки.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет КАК Счет,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2 КАК ВидДвиженияДС,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет КАК КорСчет,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 КАК Сделка,
		|	ЕСТЬNULL(_Сделки.ЭтоЦБдоПогашения, ЛОЖЬ) КАК ЭтоЦБдоПогашения,
		|	ЕСТЬNULL(_Сделки.ЭтоЦБдляПродажи, ЛОЖЬ) КАК ЭтоЦБдляПродажи,
		|	ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот КАК СуммаОборот,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_Сделки.ЭтоЦБдоПогашения, ЛОЖЬ)
		|				И (ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Покупка)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка))
		|			ТОГДА ""П34""
		|		КОГДА ЕСТЬNULL(_Сделки.ЭтоЦБдоПогашения, ЛОЖЬ)
		|				И (ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Продажа)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа))
		|			ТОГДА ""П33""
		|		КОГДА ЕСТЬNULL(_Сделки.ЭтоЦБдляПродажи, ЛОЖЬ)
		|				И (ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Покупка)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка))
		|			ТОГДА ""П30""
		|		КОГДА ЕСТЬNULL(_Сделки.ЭтоЦБдляПродажи, ЛОЖЬ)
		|				И (ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Продажа)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа))
		|			ТОГДА ""П29""
		|		КОГДА НЕ ЕСТЬNULL(_Сделки.ЭтоЦБдоПогашения, ЛОЖЬ)
		|				И НЕ ЕСТЬNULL(_Сделки.ЭтоЦБдляПродажи, ЛОЖЬ)
		|				И (ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Покупка)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка))
		|			ТОГДА ""П08""
		|		КОГДА НЕ ЕСТЬNULL(_Сделки.ЭтоЦБдоПогашения, ЛОЖЬ)
		|				И НЕ ЕСТЬNULL(_Сделки.ЭтоЦБдляПродажи, ЛОЖЬ)
		|				И (ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Продажа)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа)
		|					ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа))
		|			ТОГДА ""П07""
		|		ИНАЧЕ ""ХЗ""
		|	КОНЕЦ КАК СтрокаОтчета,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Покупка)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Покупка,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Продажа)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Продажа,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТорговаяКомиссияПокупка,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ТорговаяКомиссияПродажа,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК БрокерскаяКомиссияПокупка,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК БрокерскаяКомиссияПродажа,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Покупка)
		|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.Продажа)
		|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка)
		|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа)
		|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка)
		|				ИЛИ ЕдиныйБухгалтерскийУчетОбороты.Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа)
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот
		|	КОНЕЦ КАК Иное
		|ПОМЕСТИТЬ _ДвиженияДС
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|			&ПериодНачало,
		|			&ПериодОкончание,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетыСБрокерами02),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И КорСубконто2 В
		|					(ВЫБРАТЬ
		|						_Сделки.Сделка КАК Сделка
		|					ИЗ
		|						_Сделки КАК _Сделки),
		|			НЕ КорСчет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Единый.ДоходыРасходыОтОпераций)),
		|			) КАК ЕдиныйБухгалтерскийУчетОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Сделки КАК _Сделки
		|		ПО ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2 = _Сделки.Сделка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	_НераспределеннаяКомиссия.ЦеннаяБумага,
		|	_НераспределеннаяКомиссия.Счет,
		|	_НераспределеннаяКомиссия.ВидДвиженияДС,
		|	_НераспределеннаяКомиссия.КорСчет,
		|	_НераспределеннаяКомиссия.Сделка,
		|	_НераспределеннаяКомиссия.ЭтоЦБдоПогашения,
		|	_НераспределеннаяКомиссия.ЭтоЦБдляПродажи,
		|	_НераспределеннаяКомиссия.СуммаОборот,
		|	ВЫБОР
		|		КОГДА _НераспределеннаяКомиссия.ЦеннаяБумага = НЕОПРЕДЕЛЕНО
		|			ТОГДА ""П15""
		|		КОГДА ЕСТЬNULL(_НераспределеннаяКомиссия.ЭтоЦБдоПогашения, ЛОЖЬ)
		|			ТОГДА ""П34""
		|		КОГДА ЕСТЬNULL(_НераспределеннаяКомиссия.ЭтоЦБдляПродажи, ЛОЖЬ)
		|			ТОГДА ""П30""
		|		КОГДА НЕ ЕСТЬNULL(_НераспределеннаяКомиссия.ЭтоЦБдоПогашения, ЛОЖЬ)
		|				И НЕ ЕСТЬNULL(_НераспределеннаяКомиссия.ЭтоЦБдляПродажи, ЛОЖЬ)
		|			ТОГДА ""П08""
		|	КОНЕЦ,
		|	0,
		|	0,
		|	ВЫБОР
		|		КОГДА _НераспределеннаяКомиссия.ВидДвиженияДС = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПокупка)
		|			ТОГДА _НераспределеннаяКомиссия.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _НераспределеннаяКомиссия.ВидДвиженияДС = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ТорговаяКомиссияПродажа)
		|			ТОГДА _НераспределеннаяКомиссия.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _НераспределеннаяКомиссия.ВидДвиженияДС = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПокупка)
		|			ТОГДА _НераспределеннаяКомиссия.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА _НераспределеннаяКомиссия.ВидДвиженияДС = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.БрокерскаяКомиссияПродажа)
		|			ТОГДА _НераспределеннаяКомиссия.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	0
		|ИЗ
		|	_НераспределеннаяКомиссия КАК _НераспределеннаяКомиссия
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСТЬNULL(_Сделки.ЦеннаяБумага, ПогашениеЦеннойБумаги.ЦеннаяБумага),
		|	ЕдиныйБухгалтерскийУчетОбороты.Счет,
		|	ЕдиныйБухгалтерскийУчетОбороты.Субконто2,
		|	ЕдиныйБухгалтерскийУчетОбороты.КорСчет,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.КорСубконто2, _Сделки.Сделка),
		|	ЕСТЬNULL(_Сделки.ЭтоЦБдоПогашения, ЛОЖЬ),
		|	ЕСТЬNULL(_Сделки.ЭтоЦБдляПродажи, ЛОЖЬ),
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот, ОперацииСЦеннымиБумагами.Сумма),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(_Сделки.ЭтоЦБдоПогашения, ЛОЖЬ)
		|			ТОГДА ""П33""
		|		КОГДА ЕСТЬNULL(_Сделки.ЭтоЦБдляПродажи, ЛОЖЬ)
		|			ТОГДА ""П29""
		|		КОГДА НЕ ЕСТЬNULL(_Сделки.ЭтоЦБдоПогашения, ЛОЖЬ)
		|				И НЕ ЕСТЬNULL(_Сделки.ЭтоЦБдляПродажи, ЛОЖЬ)
		|			ТОГДА ""П07""
		|		ИНАЧЕ ""ХЗ""
		|	КОНЕЦ,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	0,
		|	ЕСТЬNULL(ЕдиныйБухгалтерскийУчетОбороты.СуммаОборот, ОперацииСЦеннымиБумагами.Сумма)
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Сделки КАК _Сделки
		|		ПО ОперацииСЦеннымиБумагами.ЦеннаяБумага = _Сделки.ЦеннаяБумага
		|			И ОперацииСЦеннымиБумагами.Основание = _Сделки.Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.Обороты(
		|				&ПериодНачало,
		|				&ПериодОкончание,
		|				Регистратор,
		|				Счет = ЗНАЧЕНИЕ(ПланСчетов.Единый.РасчетныеСчета01),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Субконто2 = ЗНАЧЕНИЕ(Справочник.ВидыДвиженияДенежныхСредств.ПогашениеОблигации),
		|				,
		|				) КАК ЕдиныйБухгалтерскийУчетОбороты
		|		ПО ОперацииСЦеннымиБумагами.Операция = ЕдиныйБухгалтерскийУчетОбороты.Регистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПогашениеЦеннойБумаги КАК ПогашениеЦеннойБумаги
		|		ПО ОперацииСЦеннымиБумагами.Основание = ПогашениеЦеннойБумаги.Ссылка
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &ПериодНачало И &ПериодОкончание
		|	И ОперацииСЦеннымиБумагами.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|	И ОперацииСЦеннымиБумагами.Сумма > 0
		|	И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Основание) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	_ДвиженияДС.СтрокаОтчета КАК СтрокаОтчета,
		|	_ДвиженияДС.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_ДвиженияДС.Сделка КАК Сделка,
		|	_ДвиженияДС.Счет КАК Счет,
		|	_ДвиженияДС.ВидДвиженияДС КАК ВидДвиженияДС,
		|	_ДвиженияДС.КорСчет КАК КорСчет,
		|	_ДвиженияДС.ЭтоЦБдоПогашения КАК ЭтоЦБдоПогашения,
		|	_ДвиженияДС.ЭтоЦБдляПродажи КАК ЭтоЦБдляПродажи,
		|	_ДвиженияДС.СуммаОборот КАК СуммаОборот,
		|	_ДвиженияДС.Покупка КАК Покупка,
		|	_ДвиженияДС.Продажа КАК Продажа,
		|	_ДвиженияДС.ТорговаяКомиссияПокупка КАК ТорговаяКомиссияПокупка,
		|	_ДвиженияДС.ТорговаяКомиссияПродажа КАК ТорговаяКомиссияПродажа,
		|	_ДвиженияДС.БрокерскаяКомиссияПокупка КАК БрокерскаяКомиссияПокупка,
		|	_ДвиженияДС.БрокерскаяКомиссияПродажа КАК БрокерскаяКомиссияПродажа,
		|	_ДвиженияДС.Иное КАК Иное
		|ИЗ
		|	_ДвиженияДС КАК _ДвиженияДС
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтрокаОтчета,
		|	ЦеннаяБумага,
		|	Сделка
		|ИТОГИ
		|	СУММА(СуммаОборот),
		|	СУММА(Покупка),
		|	СУММА(Продажа),
		|	СУММА(ТорговаяКомиссияПокупка),
		|	СУММА(ТорговаяКомиссияПродажа),
		|	СУММА(БрокерскаяКомиссияПокупка),
		|	СУММА(БрокерскаяКомиссияПродажа),
		|	СУММА(Иное)
		|ПО
		|	СтрокаОтчета,
		|	ЦеннаяБумага,
		|	Сделка"; 
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ПериодНачало", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ПериодОкончание", ЭтотОбъект.Период.ДатаОкончания);
	
	Макет =  ПолучитьМакет("Отчет");	
	//шапка
	ПараметрыШапки = ПолучитьПараметрыШапки();	
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");	
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапки);
	ОбластьШапка.Параметры.ДатаДоговора	= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	ОбластьШапка.Параметры.ПериодОтчета = ПредставлениеПериода(НачалоМесяца(ЭтотОбъект.Период.ДатаНачала), КонецМесяца(ЭтотОбъект.Период.ДатаОкончания), "ФП=Истина");
	
	ДокРезультат.Вывести(ОбластьШапка);
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьЦБ = Макет.ПолучитьОбласть("ЦеннаяБумага");
	ОбластьСделка = Макет.ПолучитьОбласть("Сделка");
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);    //
	//строки
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка,,"СтрокаОтчета");
		ОбластьСтрока.Параметры.СтрокаОтчета = ПолучитьОписаниеСтрокиОтчета(Выборка.СтрокаОтчета);
		ДокРезультат.Вывести(ОбластьСтрока);
		
		ДокРезультат.НачатьГруппуСтрок();
		ВыборкаЦБ = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаЦБ.Следующий() Цикл 
			
			ЗаполнитьЗначенияСвойств(ОбластьЦБ.Параметры, ВыборкаЦБ);
			ДокРезультат.Вывести(ОбластьЦБ);
			
			ВыборкаСделки = ВыборкаЦБ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
			
			ДокРезультат.НачатьГруппуСтрок();
			Пока ВыборкаСделки.Следующий() Цикл 
				ЗаполнитьЗначенияСвойств(ОбластьСделка.Параметры, ВыборкаСделки);
				ДокРезультат.Вывести(ОбластьСделка);			
			КонецЦикла;	
			ДокРезультат.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
		ДокРезультат.ЗакончитьГруппуСтрок();
	КонецЦикла;	
	
	ДокРезультат.ПоказатьУровеньГруппировокСтрок(0);
	
	Если Сессия <> Неопределено Тогда
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	КонецЕсли;
	
КонецПроцедуры
